hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/inc/hw_outputxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT2MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT2MUXENABLE_MUX0  0x1U         // mux0 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX16  0x10000U     // Mux16 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT2MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT2 of
                                               // OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT3MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT3MUXENABLE_MUX0  0x1U         // mux0 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX16  0x10000U     // Mux16 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT3MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT3 of
                                               // OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT4MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT4MUXENABLE_MUX0  0x1U         // mux0 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX16  0x10000U     // Mux16 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT4MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT4 of
                                               // OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT5MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT5MUXENABLE_MUX0  0x1U         // mux0 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX16  0x10000U     // Mux16 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT5MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT5 of
                                               // OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT6MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT6MUXENABLE_MUX0  0x1U         // mux0 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX16  0x10000U     // Mux16 to OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT6MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT6 of
                                               // OUTPUT-XBAR

